# IsHidden Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..IsHidden Property
ScheduleField Class See Also
---
Indicates if the field is hidden in the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsHidden { get; set; }
```

Visual Basic
---
```text
Public Property IsHidden As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsHidden {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if the field is hidden, false otherwise.
# Remarks
A hidden field is not displayed in the schedule, but it can be used for filtering, sorting, grouping, and conditional formatting and can be referenced by Formula and Percentage fields.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace